PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
/*******************************************************************************
 * @file    Flash_STM32xx.c
 * @author  Linghu(Linghu0060@qq.com)
 * @version v1.0.0
 * @date    2019/7/27
 * @brief   CMSIS-Driver for STM32xxx Embedded Flash.\n
 *          1. 将 STM32xxx 内部 Flash 在分为 IAP 和 EFS 2个区域.\n
 *          2. IAP 区域为整个 Flash 区域.\n
 *          3. EFS 区域[地址/长度]可配置, 默认为 Flash 尾部未使用区域, 一般用于文件系统.\n
 *          4. 接口为 CMSIS-Driver Flash Interface, 使用物理地址访问.\n
 *******************************************************************************
 * @par Last Commit:
 *      \$Author: User $ \n
 *      \$Date: 2015-02-02 11:01:08 +0800 $ \n
 *      \$Rev: 1 $ \n
 *
 * @par Change Logs:
 *      2019/7/27 --- Linghu -- the first version, Suport STM32F10x family
 *
 * @par Change Logs:
 *      2019/11/26 -- Linghu -- Add Suport STM32F2 family
 ******************************************************************************/
//lint +libclass(all)
//lint -$
//lint -e537                    // Repeated include file 'xxxx'
//lint -e750                    // local macro 'xxxx' not referenced
//lint -e752                    // local declarator 'xxxx' not referenced
//lint ++dassert(e)=
//lint ++dassert_msg(e, msg)=
//lint -emacro({506}, *)        // Constant value Boolean
//lint -emacro({702}, *)        // Shift right of signed quantity
//lint -emacro({774}, *)        // Boolean within 'if' always evaluates to True/False
//lint -emacro({835}, *)        // A zero has been given as right argument to operator 'xx'
//lint -emacro({10}, ARM_Driver_Flash_)
//lint -emacro({31}, ARM_Driver_Flash_)

#ifdef   APP_CFG
#include APP_CFG                // Apps configuration
#endif
#define  LOG_TAG  "FLASH"
#include "emb_log.h"
#define  ONLY_USED_REGS
#include "board.h"              // Device's defines

#include <string.h>
#include <stdbool.h>
#include "Driver_Flash.h"
#include "emb_critical.h"
#include "defines.h"            // Used: ARRAY_SIZE(), MIN(), MAX(), UNUSED_VAR()
#include "emb_delay.h"
#include "Flash_STM32xx.h"


/*******************************************************************************
 * @addtogroup __Config
 * @{
 * @addtogroup          Flash_STM32xx
 * @{
 ******************************************************************************/

#ifndef IAP_FLASH_NUM
#define IAP_FLASH_NUM             0     //!< (C) IAP Flash driver number
#endif

#ifndef EFS_FLASH_NUM
#define EFS_FLASH_NUM            -1     //!< (C) EFS Flash driver number, (< 0)Disable
#endif

#ifndef EFS_FLASH_ADDR
#define EFS_FLASH_ADDR            0     //!< (C) EFS Flash addr, (== 0)Auto
#endif
#ifndef EFS_FLASH_SIZE
#define EFS_FLASH_SIZE            0     //!< (C) EFS Flash size, (== 0)Auto
#endif


/*******************************************************************************
 * @}
 * @}
 * @addtogroup Flash_STM32xx
 * @{
 * @addtogroup              Pravate_Macros
 * @{
 ******************************************************************************/

#define FLASH_INVALID_ADDR      SRAM_BASE       // Invalid flash address

#  if  (FLASH_PAGE_SIZE == 4)
#define FLASH_PAGE_TYPE         uint32_t        // Data type of FLASH_PAGE_SIZE
#elif  (FLASH_PAGE_SIZE == 2)
#define FLASH_PAGE_TYPE         uint16_t
#else
#define FLASH_PAGE_TYPE         uint8_t
#endif


/*******************************************************************************
 * @}
 * @addtogroup              Pravate_Variables
 * @{
 ******************************************************************************/

static ARM_FLASH_SECTOR  _Flash_Sectors[]  = FLASH_SECTORS; // Table of Flash Sectors

static ARM_FLASH_STATUS  _Flash_Status = {                  // Flash Status
    0,                  // busy:  Flash busy flag
    0,                  // error: Error flag
    0
};

static struct _ARM_FLASH_INFO  _IAP_FlashInfo = {           // IAP Flash Information
    NULL,               // sector_info:  Sector layout information (NULL: Uniform sectors)
    0,                  // sector_count: Number of sectors
    0,                  // sector_size:  Uniform sector size in bytes (0: sector_info used)
    FLASH_PAGE_SIZE,    // page_size:    Optimal programming page size in bytes
    FLASH_PROGRAM_UNIT, // program_unit: Smallest programmable unit in bytes
    FLASH_ERASED_VALUE, // erased_value: Contents of erased memory (usually 0xFF)
  #if (ARM_FLASH_API_VERSION > 0x201U)
    { 0U, 0U, 0U }
  #endif
};

#if (EFS_FLASH_NUM >= 0)
static struct _ARM_FLASH_INFO  _EFS_FlashInfo = {           // EFS Flash Information
    NULL,               // sector_info:  Sector layout information (NULL: Uniform sectors)
    0,                  // sector_count: Number of sectors
    0,                  // sector_size:  Uniform sector size in bytes (0: sector_info used)
    FLASH_PAGE_SIZE,    // page_size:    Optimal programming page size in bytes
    FLASH_PROGRAM_UNIT, // program_unit: Smallest programmable unit in bytes
    FLASH_ERASED_VALUE, // erased_value: Contents of erased memory (usually 0xFF)
  #if (ARM_FLASH_API_VERSION > 0x201U)
    { 0U, 0U, 0U }
  #endif
};
#endif


/*******************************************************************************
 * @}
 * @addtogroup              Pravate_Functions
 * @{
 ******************************************************************************/
/**
 * Wait for a FLASH operation to complete.
 *
 * @param[in]  Timeout  Timeout maximum flash operationtimeout
 *
 * @retval     (== 0) Succeed
 * @retval     (!= 0) TimeOut or Error
 */
__STATIC_INLINE int32_t Flash_WaitComplete(uint32_t Timeout)
{
    uint32_t  msec = GetSysMsec();

    // Wait for the FLASH operation to complete
    while(   ((FLASH->SR  & FLASH_SR_BSY) != 0)
    #if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
          || ((FLASH->SR2 & FLASH_SR_BSY) != 0)
    #endif
         )
    {
        if((GetSysMsec() - msec) >= Timeout) {
            LOG_ERROR("End of operation timeout: %lu", Timeout);
            return( -1 );   // TimeOut
        }
    }

