PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
    // Clear FLASH End of Operation bit
    if((FLASH->SR & FLASH_SR_EOP) != 0) {
        FLASH->SR = FLASH_SR_EOP;
    }
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    if((FLASH->SR2 & FLASH_SR_EOP) != 0) {
        FLASH->SR2 = FLASH_SR_EOP;
    }
#endif

    // Check FLASH Operation Error Flag
    if((FLASH->SR & FLASH_SR_ERR_FLAG) != 0) {
        LOG_ERROR("Operation error, FLASH SR: 0x%08lX", (uint32_t)FLASH->SR);
        FLASH->SR = FLASH_SR_ERR_FLAG;
        return( -2 );   // Error
    }
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    if((FLASH->SR2 & FLASH_SR_ERR_FLAG) != 0) {
        LOG_ERROR("Operation error, FLASH SR2: 0x%08lX", (uint32_t)FLASH->SR2);
        FLASH->SR2 = FLASH_SR_ERR_FLAG;
        return( -2 );   // Error
    }
#endif

    // Clear Program and Erase Operation bit
    FLASH->CR  &= ~FLASH_CR_OPT_FLAG;
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    FLASH->CR2 &= ~FLASH_CR_OPT_FLAG;
#endif

    return( 0 );
}


/**
 * Flush the instruction and data caches
 */
__STATIC_INLINE void Flash_CachesFlush(void)
{
#if defined(STM32F2) || defined(STM32F4)
    if((FLASH->ACR & FLASH_ACR_ICEN) != 0)
    {   // Flush instruction cache
        FLASH->ACR &= ~FLASH_ACR_ICEN;
        FLASH->ACR |=  FLASH_ACR_ICRST;
        FLASH->ACR &= ~FLASH_ACR_ICRST;
        FLASH->ACR |=  FLASH_ACR_ICEN;
    }
    if((FLASH->ACR & FLASH_ACR_DCEN) != 0)
    {   // Flush data cache
        FLASH->ACR &= ~FLASH_ACR_DCEN;
        FLASH->ACR |=  FLASH_ACR_DCRST;
        FLASH->ACR &= ~FLASH_ACR_DCRST;
        FLASH->ACR |=  FLASH_ACR_DCEN;
    }
#endif
}


/**
 * Unlock the FLASH control register access
 */
__STATIC_INLINE void Flash_CtrlUnlock(void)
{
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    FLASH->KEYR2 = FLASH_KEY1;
    FLASH->KEYR2 = FLASH_KEY2;
#endif
}


/**
 * Locks the FLASH control register access
 */
__STATIC_INLINE void Flash_CtrlLocked(void)
{
    FLASH->CR  |= FLASH_CR_LOCK;
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    FLASH->CR2 |= FLASH_CR_LOCK;
#endif
}


/**
 * Address to Flash Sector Number or Address
 *
 * @param[in]  addr   Address
 *
 * @retval  (!= UINT32_MAX) Flash Sector Number or Address
 * @retval  (== UINT32_MAX) Failed
 */
__STATIC_INLINE uint32_t Flash_AddrToSector(uint32_t addr)
{
    uint32_t    start, end;
    uint32_t    i;

    for(i = 0;  i < ARRAY_SIZE(_Flash_Sectors);  i++)
    {
        start = _Flash_Sectors[i].start;
        end   = _Flash_Sectors[i].end;

        if (start > end) {
            continue;       // Invalid Sector in _Flash_Sectors[]
        }
        if((start <= addr) && (addr <= end)) {
            break;
        }
    }

#  if defined(STM32F1) || defined(STM32F3)
    return( (i < ARRAY_SIZE(_Flash_Sectors)) ? _Flash_Sectors[i].start : UINT32_MAX );
#elif defined(STM32F2) || defined(STM32F4)
    return( (i < ARRAY_SIZE(_Flash_Sectors)) ? i : UINT32_MAX );
#else
#error "Unsupported stm32 family."
#endif
}


/**
 * Flash erase operation
 *
 * @param[in]  sector   sector number or sector address
 */
__STATIC_INLINE void Flash_OptErase(uint32_t sector)
{
#if defined(STM32F1) || defined(STM32F3)
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    if (sector > FLASH_BANK1_END) {
        FLASH->CR2 |= FLASH_CR_PER;
        FLASH->AR2  = sector;
        FLASH->CR2 |= FLASH_CR_STRT;
    } else
#endif
    {   FLASH->CR |= FLASH_CR_PER;
        FLASH->AR  = sector;
        FLASH->CR |= FLASH_CR_STRT;
    }
#elif defined(STM32F2) || defined(STM32F4)
    FLASH->CR &= ~FLASH_CR_PSIZE;
    FLASH->CR |= (  (FLASH_PAGE_SIZE == 4) ? FLASH_PSIZE_WORD
                  : (FLASH_PAGE_SIZE == 2) ? FLASH_PSIZE_HALF_WORD
                  :                          FLASH_PSIZE_BYTE
                 );
    FLASH->CR &= ~FLASH_CR_SNB;
    FLASH->CR |=  FLASH_CR_SER | (sector << 3);
    FLASH->CR |=  FLASH_CR_STRT;
#else
#error "Unsupported stm32 family."
#endif
}


/**
 * Program BYTE(8-bit) at a specified address.
 */
__STATIC_INLINE void Flash_OptProgByte(uint32_t addr, uint8_t data)
{
#if defined(STM32F1) || defined(STM32F3)
    union _byte_word{ uint8_t byte[2]; uint16_t word; }  byte_word;

    if (addr & 0x1UL) {
        addr &= ~1UL
        byte_word.byte[0] = ((const uint8_t *)addr)[0];
        byte_word.byte[1] = data;
    } else {
        byte_word.byte[0] = data;
        byte_word.byte[1] = ((const uint8_t *)addr)[1];
    }
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    if (addr > FLASH_BANK1_END) {
        FLASH->CR2 |= FLASH_CR_PG;
    } else
#endif
    {   FLASH->CR  |= FLASH_CR_PG;   }
    ((volatile uint16_t *)addr)[0] = byte_word.word;

#elif defined(STM32F2) || defined(STM32F4)
    FLASH->CR &= ~FLASH_CR_PSIZE;
    FLASH->CR |=  FLASH_PSIZE_BYTE;
    FLASH->CR |=  FLASH_CR_PG;
    ((volatile uint8_t *)addr)[0]  = data;
#else
#error "Unsupported stm32 family."
#endif
}


/**
 * Program FLASH_PAGE_SIZE at a specified address.
 */
__STATIC_INLINE void Flash_OptProgPage(uint32_t addr, uint32_t data)
{
#if defined(STM32F1) || defined(STM32F3)
#if defined(STM32F1) && (defined(STM32F10X_XL) || defined(FLASH_BANK2_END))
    if (addr > FLASH_BANK1_END) {
        FLASH->CR2 |= FLASH_CR_PG;
    } else
#endif
    {   FLASH->CR  |= FLASH_CR_PG;   }
    ((volatile FLASH_PAGE_TYPE *)addr)[0]  = data;

#elif defined(STM32F2) || defined(STM32F4)
    FLASH->CR &= ~FLASH_CR_PSIZE;
    FLASH->CR |= (  (FLASH_PAGE_SIZE == 4) ? FLASH_PSIZE_WORD
                  : (FLASH_PAGE_SIZE == 2) ? FLASH_PSIZE_HALF_WORD
                  :                          FLASH_PSIZE_BYTE
                 );
    FLASH->CR |=  FLASH_CR_PG;
    ((volatile FLASH_PAGE_TYPE *)addr)[0]  = data;
#else
#error "Unsupported stm32 family."
#endif
}


/**
 * Read data from Flash physical address.
 *
 * @param[in]  addr   Physical address.
 * @param[out] data   Pointer to a buffer storing the data read from Flash.
 * @param[in]  cnt    Number of bytes to read.
 *
 * @return  number of bytes read or \ref execution_status
 */
static int32_t Flash_Read(uint32_t addr, void *data, uint32_t cnt)
{
//  LOG_VERB("Read Address: 0x%08lX, Bytes: %lu", addr, cnt);
    memcpy(data, (void *)addr, cnt);
    return( cnt );  //lint !e713  " Loss of precision "
}


/**
 * Program data to Flash physical address.
 *
 * @param[in]  addr   Physical address.
 * @param[in]  data   Pointer to a buffer containing the data to be programmed to Flash.
 * @param[in]  cnt    Number of bytes to program.
 *
 * @return  number of bytes programmed or \ref execution_status
 */
static int32_t Flash_Program(uint32_t addr, const void *data, uint32_t cnt)
{
    uint32_t  temp;
    uint32_t  i;
    uint32_t  num = cnt;

