PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
//  LOG_VERB("Program Address: 0x%08lX, Bytes: %lu", addr, cnt);
    Flash_CtrlUnlock();

    for(i = MIN((FLASH_PAGE_SIZE - addr) % FLASH_PAGE_SIZE, num);  i > 0;  i--)
    {
        temp = ((const uint8_t *)data)[0];

        //---------- Flash Program -----------------------------
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }
        Flash_OptProgByte(addr, temp);  //lint !e734    // Program
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //---------- Program Check -----------------------------
        if (temp != ((const uint8_t *)addr)[0]) {
            LOG_ERROR(  "Error Program Check, Address: 0x%08lX, Bytes: %u, P/R: 0x%02X/0x%02X"
                      , (uint32_t) addr
                      , (unsigned) sizeof(uint8_t)
                      , (unsigned) temp
                      , (unsigned) ((const uint8_t *)addr)[0]
                     );
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //------------ Next Data -------------------------------
        num  -= sizeof(uint8_t);
        addr += sizeof(uint8_t);
        data  = sizeof(uint8_t) + ((const uint8_t *)data);
    }

    for(i = num / FLASH_PAGE_SIZE;  i > 0;  i--)
    {
        temp = ((const FLASH_PAGE_TYPE *)data)[0];  // 注意存在非对齐内存访问

        //---------- Flash Program -----------------------------
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }
        Flash_OptProgPage(addr, temp);                  // Program
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //---------- Program Check -----------------------------
        if (temp != ((const FLASH_PAGE_TYPE *)addr)[0]) {
            LOG_ERROR(  "Error Program Check, Address: 0x%08lX, Bytes: %u, P/R: 0x%02lX/0x%02lX"
                      , (uint32_t) addr
                      , (unsigned) sizeof(FLASH_PAGE_TYPE)
                      , (uint32_t) temp
                      , (uint32_t) ((const FLASH_PAGE_TYPE *)addr)[0]
                     );
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //------------ Next Data -------------------------------
        num  -= FLASH_PAGE_SIZE;
        addr += FLASH_PAGE_SIZE;
        data  = FLASH_PAGE_SIZE + ((const uint8_t *)data);
    }

    for(i = num;  i > 0;  i--)
    {
        temp = ((const uint8_t *)data)[0];

        //---------- Flash Program -----------------------------
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }
        Flash_OptProgByte(addr, temp);  //lint !e734    // Program
        if (Flash_WaitComplete(FLASH_TIMEOUT_PROGRAM) != 0) {
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //---------- Program Check -----------------------------
        if (temp != ((const uint8_t *)addr)[0]) {
            LOG_ERROR(  "Error Program Check, Address: 0x%08lX, Bytes: %u, P/R: 0x%02X/0x%02X"
                      , (uint32_t) addr
                      , (unsigned) sizeof(uint8_t)
                      , (unsigned) temp
                      , (unsigned) ((const uint8_t *)addr)[0]
                     );
            cnt = (uint32_t)ARM_DRIVER_ERROR;  num = 0;  break;
        }

        //------------ Next Data -------------------------------
        num  -= sizeof(uint8_t);
        addr += sizeof(uint8_t);
        data  = sizeof(uint8_t) + ((const uint8_t *)data);
    }

    Flash_CtrlLocked();
    if (num != 0) {
        return( ARM_DRIVER_ERROR );
    }
    return( cnt );  //lint !e713
}


/**
 * Erase Flash.
 *
 * @param[in]  addr   Physical address
 *
 * @return  \ref execution_status
 */
static int32_t Flash_Erase(uint32_t addr)
{
    uint32_t sector;
    int32_t  status = ARM_DRIVER_OK;

//  LOG_VERB("Erase Addres: 0x%08lX", addr);
    if ((sector = Flash_AddrToSector(addr)) == UINT32_MAX) {
        return( ARM_DRIVER_ERROR );
    }
    Flash_CtrlUnlock();

    if (Flash_WaitComplete(FLASH_TIMEOUT_ERASE) != 0) {
        status = ARM_DRIVER_ERROR;
    }
    else {
        Flash_OptErase(sector);     // Erase
        if (Flash_WaitComplete(FLASH_TIMEOUT_ERASE) != 0) {
            status = ARM_DRIVER_ERROR;
        }
        Flash_CachesFlush();
    }

    Flash_CtrlLocked();
    return( status );
}


/******************************************************************************/
/**
 * Initialize the Flash information.
 *
 * @return  \ref execution_status
 */
static int32_t Flash_Init(void)
{
    uint32_t    addr1, addr2;
    uint32_t    size;
    uint32_t    sec1, sec2;

    if ((_IAP_FlashInfo.sector_info != NULL) || (_IAP_FlashInfo.sector_size != 0)) {
        return( ARM_DRIVER_ERROR_SPECIFIC );    // Has been initialized
    }

    _IAP_FlashInfo.sector_info  = NULL;
    _IAP_FlashInfo.sector_count = 0;
    _IAP_FlashInfo.sector_size  = 0;
    _IAP_FlashInfo.page_size    = FLASH_PAGE_SIZE;
    _IAP_FlashInfo.program_unit = FLASH_PROGRAM_UNIT;
    _IAP_FlashInfo.erased_value = FLASH_ERASED_VALUE;

#if (EFS_FLASH_NUM >= 0)
    _EFS_FlashInfo.sector_info  = NULL;
    _EFS_FlashInfo.sector_count = 0;
    _EFS_FlashInfo.sector_size  = 0;
    _EFS_FlashInfo.page_size    = FLASH_PAGE_SIZE;
    _EFS_FlashInfo.program_unit = FLASH_PROGRAM_UNIT;
    _EFS_FlashInfo.erased_value = FLASH_ERASED_VALUE;
#endif

    /*------------------------- IAP Flash ------------------------------------*/
    if((addr1 = FLASH_START_ADDR) < FLASH_BASE) {
        addr1 = FLASH_BASE;                     // IAP 开始地址
    }
    addr2 = FLASH_BASE + FLASH_TOTAL_SIZE - 1;  // IAP 结束地址

    for(sec1 = 0;  sec1 < ARRAY_SIZE(_Flash_Sectors);  sec1++)
    {  // 根据扇区信息表、EFS Flash开始地址 查找 IAP 开始扇区
        if (_Flash_Sectors[sec1].start > _Flash_Sectors[sec1].end) {
            continue;   // Invalid Sector in _Flash_Sectors[]
        }
        if (_Flash_Sectors[sec1].start >= addr1) {
            break;
        }
    }
    for(size = 0, sec2 = sec1;  sec2 < ARRAY_SIZE(_Flash_Sectors);  sec2++)
    {   // 根据扇区信息表、Flash开始地址、Flash大小 计算 IAP 大小与扇区数
        size += _Flash_Sectors[sec2].end + 1 - _Flash_Sectors[sec2].start;
        if (_Flash_Sectors[sec2].end >= addr2) {
            break;
        }
    }
    addr2 = addr1 + size - 1;
    _IAP_FlashInfo.sector_info  = &(_Flash_Sectors[sec1]);
    _IAP_FlashInfo.sector_count =  (sec2 + 1 - sec1);
    _IAP_FlashInfo.sector_size  =   0;

    if( !((1 <= _IAP_FlashInfo.sector_count) && (_IAP_FlashInfo.sector_count <= ARRAY_SIZE(_Flash_Sectors)))
       || (size == 0)
      ) {
        LOG_WARN("IAP Flash initialization failed: 0x%08lX - 0x%08lX", addr1, addr2);
        return( ARM_DRIVER_ERROR_PARAMETER );   // 无效的 IAP Flash
    }
    LOG_INFO(  "IAP Flash Address: 0x%08lX, Size: 0x%08lX, Sectors: %lu"
             , _IAP_FlashInfo.sector_info->start
             ,  size
             , _IAP_FlashInfo.sector_count
            );
    if ((_IAP_FlashInfo.sector_info->start != FLASH_BASE) || (size != FLASH_TOTAL_SIZE)) {
        LOG_INFO(  "IAP Flash from 0x%08lX:0x%08lX changed to 0x%08lX:0x%08lX"
                 , (uint32_t)FLASH_BASE
                 , (uint32_t)FLASH_TOTAL_SIZE
                 , (uint32_t)_IAP_FlashInfo.sector_info->start
                 , (uint32_t)size
                );
    }

    /*------------------------- EFS Flash ------------------------------------*/
#if (EFS_FLASH_NUM >= 0)
    if((size = EFS_FLASH_SIZE) == 0) {  //lint !e506 !e774  // 自动分配 EFS 大小
        size = MIN(FLASH_EFS_DEF_SIZE, FLASH_BASE + FLASH_TOTAL_SIZE - ROM_LINK_LIMIT);
    }
    if((addr1 = EFS_FLASH_ADDR) == 0) { //lint !e506 !e774  // 自动分配 EFS 地址
        addr1 = MAX(FLASH_BASE + FLASH_TOTAL_SIZE - size, ROM_LINK_LIMIT);
    }
    if (addr1 < FLASH_BASE) {
        addr1 = FLASH_BASE;                                 // EFS 开始地址
    }
    if((addr2 = (addr1 + size - 1)) > (FLASH_BASE + FLASH_TOTAL_SIZE - 1)) {
        addr2 =  FLASH_BASE + FLASH_TOTAL_SIZE - 1;         // EFS 结束地址
    }
    for(sec1 = 0;  sec1 < ARRAY_SIZE(_Flash_Sectors);  sec1++)
    {  // 根据扇区信息表、EFS Flash开始地址 查找 EFS 开始扇区
        if (_Flash_Sectors[sec1].start > _Flash_Sectors[sec1].end) {
            continue;   // Invalid Sector in _Flash_Sectors[]
        }
        if (_Flash_Sectors[sec1].start >= addr1) {
            break;
        }
    }
    for(size = 0, sec2 = sec1;  sec2 < ARRAY_SIZE(_Flash_Sectors);  sec2++)
    {   // 根据扇区信息表、Flash开始地址、Flash大小 计算 EFS 大小与扇区数
        size += _Flash_Sectors[sec2].end + 1 - _Flash_Sectors[sec2].start;
        if (_Flash_Sectors[sec2].end >= addr2) {
            break;
        }
    }
    addr2 = addr1 + size - 1;
    _EFS_FlashInfo.sector_info  = &(_Flash_Sectors[sec1]);
    _EFS_FlashInfo.sector_count =  (sec2 + 1 - sec1);
    _EFS_FlashInfo.sector_size  =   0;

