PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
    if( !((1 <= _EFS_FlashInfo.sector_count) && (_EFS_FlashInfo.sector_count <= ARRAY_SIZE(_Flash_Sectors)))
       || (size == 0)
      ) {
        LOG_WARN("EFS Flash initialization failed: 0x%08lX - 0x%08lX", addr1, addr2);
        return( ARM_DRIVER_ERROR_PARAMETER );   // 无效的 EFS Flash
    }
    if(   ((ROM_LINK_START <= addr1) && (addr1 <= ROM_LINK_LIMIT))  //lint !e568 !e685 !e775
       || ((ROM_LINK_START <= addr2) && (addr2 <= ROM_LINK_LIMIT))  //lint !e568 !e685 !e775
      ) {
        LOG_WARN("EFS Flash regional overlapping: 0x%08lX - 0x%08lX", addr1, addr2);
        return( ARM_DRIVER_ERROR_PARAMETER );   // 无效的 EFS Flash
    }
    LOG_INFO(  "EFS Flash Address: 0x%08lX, Size: 0x%08lX, Sectors: %lu"
             , _EFS_FlashInfo.sector_info->start
             , size
             , _EFS_FlashInfo.sector_count
            );
    if((_EFS_FlashInfo.sector_info->start != EFS_FLASH_ADDR) || (size != EFS_FLASH_SIZE)) {
        LOG_INFO(  "EFS Flash from 0x%08lX:0x%08lX changed to 0x%08lX:0x%08lX"
                 , (uint32_t)EFS_FLASH_ADDR
                 , (uint32_t)EFS_FLASH_SIZE
                 , (uint32_t)_EFS_FlashInfo.sector_info->start
                 , (uint32_t)size
                );
    }
#endif

    return( ARM_DRIVER_OK );
}


/******************************************************************************/
/**
 * Get driver version.
 *
 * @return  \ref ARM_DRIVER_VERSION
 */
static ARM_DRIVER_VERSION GetVersion(void)
{
    static const ARM_DRIVER_VERSION  DriverVersion = {
        ARM_FLASH_API_VERSION,
        ARM_FLASH_DRV_VERSION
    };

    return( DriverVersion );
}


/**
 * Get driver capabilities.
 *
 * @return  \ref ARM_FLASH_CAPABILITIES
 */
static ARM_FLASH_CAPABILITIES GetCapabilities(void)
{
    static const ARM_FLASH_CAPABILITIES  DriverCapabilities = {
        FLASH_EVENT_READY,
        FLASH_DATA_WIDTH,
        FLASH_ERASE_CHIP,
      #if (ARM_FLASH_API_VERSION > 0x200U)
        0U    /* reserved */
      #endif
    };

    return( DriverCapabilities );
}


/**
 * Initialize the Flash Interface.
 *
 * @param[in]  cb_event  Pointer to \ref ARM_Flash_SignalEvent
 *
 * @return  \ref execution_status
 */
static int32_t Initialize(ARM_Flash_SignalEvent_t cb_event)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();
    UNUSED_VAR(cb_event);

    LOG_VERB("Initialize the Flash Driver");
    CRITICAL_SECTION_ENTER();
    switch (status = Flash_Init())
    {
    case ARM_DRIVER_OK:
        _Flash_Status.busy  = 0;
        _Flash_Status.error = 0;
        break;

    case ARM_DRIVER_ERROR_SPECIFIC:
        status = ARM_DRIVER_OK;
        break;

    default:
        _Flash_Status.busy  = 0;
        _Flash_Status.error = 1;
        break;
    }
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * De-initialize the Flash Interface.
 *
 * @return  \ref execution_status
 */
static int32_t Uninitialize(void)
{
    LOG_VERB("De-initialize the Flash Driver");
    return( ARM_DRIVER_OK );
}


/**
 * Control the Flash interface power.
 *
 * @param[in]  state  Power state
 *
 * @return  \ref execution_status
 */
static int32_t PowerControl(ARM_POWER_STATE state)
{
    UNUSED_VAR(state);

    return( ARM_DRIVER_OK );
}


/**
 * Get Flash status.
 *
 * @return  Flash status \ref ARM_FLASH_STATUS
 */
static ARM_FLASH_STATUS GetStatus(void)
{
    ARM_FLASH_STATUS   status;
    CRITICAL_SECTION_ALLOC();

    CRITICAL_SECTION_ENTER();
    status = _Flash_Status;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Erase complete Flash.
 *
 * @return  \ref execution_status
 */
static int32_t EraseChip(void)
{
    return( ARM_DRIVER_ERROR_UNSUPPORTED );
}


/*----------------------------------------------------------------------------*/
/**
 * IAP Flash logical address map to physical address.
 *
 * @param[in]  addr   Logical address, start of 0.
 * @param[in]  len    Logical address area length.
 *
 * @return  Physical address, Failed to return FLASH_INVALID_ADDR.
 */
__STATIC_INLINE uint32_t IAP_AddrMap(uint32_t addr, uint32_t len)
{
    uint32_t    start, end;
    uint32_t    sec;

    for(sec = 0;  sec < _IAP_FlashInfo.sector_count;  sec++)
    {   // 查找开始地址所在扇区
        start = _IAP_FlashInfo.sector_info[sec].start;
        end   = _IAP_FlashInfo.sector_info[sec].end;

        if (start > end) {
            continue;   // Invalid Sector in _IAP_FlashInfo.sector_info[]
        }
        if (addr >= start) {
            break;
        }
    }
    for(;  sec < _IAP_FlashInfo.sector_count;  sec++)
    {   // 查找结束地址所以在扇区
        start = _IAP_FlashInfo.sector_info[sec].start;
        end   = _IAP_FlashInfo.sector_info[sec].end;

        if (start > end) {
            continue;   // Invalid Sector in _IAP_FlashInfo.sector_info[]
        }
        if ((addr + len - 1) <= end) {
            break;
        }
    }
    if (sec >= _IAP_FlashInfo.sector_count) {
        LOG_ERROR("IAP Flash Operation error, Address: 0x%08lX, Bytes: %lu", addr, len);
        return( FLASH_INVALID_ADDR );   // 开始或结束地址错误
    }
    return( addr );
}


/**
 * Read data from Flash.
 *
 * @param[in]  addr  Data address.
 * @param[out] data  Pointer to a buffer storing the data read from Flash.
 * @param[in]  cnt   Number of data items to read.
 *
 * @return  number of data items read or \ref execution_status
 */
static int32_t IAP_ReadData(uint32_t addr, void* data, uint32_t cnt)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    cnt <<= FLASH_DATA_WIDTH;
    LOG_VERB("IAP Flash Read, Address: 0x%08lX, Bytes: %lu", addr, cnt);
    if (data == NULL) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }
    if((addr = IAP_AddrMap(addr, cnt)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

    status = Flash_Read(addr, data, cnt);

    CRITICAL_SECTION_ENTER();
    if (status < 0) {
        _Flash_Status.error = 1;
    }
    else {
        status >>= FLASH_DATA_WIDTH;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Program data to Flash.
 *
 * @param[in]  addr   Data address.
 * @param[in]  data   Pointer to a buffer containing the data to be programmed to Flash.
 * @param[in]  cnt    Number of data items to program.
 *
 * @return  number of data items programmed or \ref execution_status
 */
static int32_t IAP_ProgramData(uint32_t addr, const void* data, uint32_t cnt)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    cnt <<= FLASH_DATA_WIDTH;
    LOG_VERB("IAP Flash Program, Address: 0x%08lX, Bytes: %lu", addr, cnt);
    if (data == NULL) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }
    if((addr = IAP_AddrMap(addr, cnt)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

    status = Flash_Program(addr, data, cnt);

    CRITICAL_SECTION_ENTER();
    if (status < 0) {
        _Flash_Status.error = 1;
    }
    else {
        status >>= FLASH_DATA_WIDTH;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Erase Flash Sector.
 *
 * @param[in]  addr   Sector address
 *
 * @return  \ref execution_status
 */
static int32_t IAP_EraseSector(uint32_t addr)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    LOG_VERB("IAP Flash Erase, Address: 0x%08lX", addr);
    if((addr = IAP_AddrMap(addr, 1)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

