PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
    status = Flash_Erase(addr);

    CRITICAL_SECTION_ENTER();
    if (status != ARM_DRIVER_OK) {
        _Flash_Status.error = 1;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Get Flash information.
 *
 * @return  Pointer to Flash information \ref ARM_FLASH_INFO
 */
static ARM_FLASH_INFO* IAP_GetInfo(void)
{
    return( &_IAP_FlashInfo );
}


/* IAP Flash Driver Control Block */
ARM_DRIVER_FLASH  ARM_Driver_Flash_(IAP_FLASH_NUM) = {
    GetVersion,
    GetCapabilities,
    Initialize,
    Uninitialize,
    PowerControl,
    IAP_ReadData,
    IAP_ProgramData,
    IAP_EraseSector,
    EraseChip,
    GetStatus,
    IAP_GetInfo
};


#if (EFS_FLASH_NUM >= 0)
/*----------------------------------------------------------------------------*/
/**
 * EFS Flash logical address map to physical address.
 *
 * @param[in]  addr   Logical address, start of 0.
 * @param[in]  len    Logical address area length.
 *
 * @return  Physical address, Failed to return FLASH_INVALID_ADDR.
 */
__STATIC_INLINE uint32_t EFS_AddrMap(uint32_t addr, uint32_t len)
{
    uint32_t    start, end;
    uint32_t    sec;

    for(sec = 0;  sec < _EFS_FlashInfo.sector_count;  sec++)
    {   // 查找开始地址所在扇区
        start = _EFS_FlashInfo.sector_info[sec].start;
        end   = _EFS_FlashInfo.sector_info[sec].end;

        if (start > end) {
            continue;   // Invalid Sector in _EFS_FlashInfo.sector_info[]
        }
        if (addr >= start) {
            break;
        }
    }
    for(;  sec < _EFS_FlashInfo.sector_count;  sec++)
    {   // 查找结束地址所以在扇区
        start = _EFS_FlashInfo.sector_info[sec].start;
        end   = _EFS_FlashInfo.sector_info[sec].end;

        if (start > end) {
            continue;   // Invalid Sector in _EFS_FlashInfo.sector_info[]
        }
        if ((addr + len - 1) <= end) {
            break;
        }
    }
    if (sec >= _EFS_FlashInfo.sector_count) {
        LOG_ERROR("EFS Flash Operation error, Address: 0x%08lX, Bytes: %lu", addr, len);
        return( FLASH_INVALID_ADDR );   // 开始或结束地址错误
    }
    return( addr );
}


/**
 * Read data from Flash.
 *
 * @param[in]  addr  Data address.
 * @param[out] data  Pointer to a buffer storing the data read from Flash.
 * @param[in]  cnt   Number of data items to read.
 *
 * @return  number of data items read or \ref execution_status
 */
static int32_t EFS_ReadData(uint32_t addr, void* data, uint32_t cnt)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    cnt <<= FLASH_DATA_WIDTH;
    LOG_VERB("EFS Flash Read, Address: 0x%08lX, Bytes: %lu", addr, cnt);
    if (data == NULL) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }
    if((addr = EFS_AddrMap(addr, cnt)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

    status = Flash_Read(addr, data, cnt);

    CRITICAL_SECTION_ENTER();
    if (status < 0) {
        _Flash_Status.error = 1;
    }
    else {
        status >>= FLASH_DATA_WIDTH;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Program data to Flash.
 *
 * @param[in]  addr   Data address.
 * @param[in]  data   Pointer to a buffer containing the data to be programmed to Flash.
 * @param[in]  cnt    Number of data items to program.
 *
 * @return  number of data items programmed or \ref execution_status
 */
static int32_t EFS_ProgramData(uint32_t addr, const void* data, uint32_t cnt)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    cnt <<= FLASH_DATA_WIDTH;
    LOG_VERB("EFS Flash Program, Address: 0x%08lX, Bytes: %lu", addr, cnt);
    if (data == NULL) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }
    if((addr = EFS_AddrMap(addr, cnt)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

    status = Flash_Program(addr, data, cnt);

    CRITICAL_SECTION_ENTER();
    if (status < 0) {
        _Flash_Status.error = 1;
    }
    else {
        status >>= FLASH_DATA_WIDTH;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Erase Flash Sector.
 *
 * @param[in]  addr   Sector address
 *
 * @return  \ref execution_status
 */
static int32_t EFS_EraseSector(uint32_t addr)
{
    int32_t     status;
    CRITICAL_SECTION_ALLOC();

    LOG_VERB("EFS Flash Erase, Address: 0x%08lX", addr);
    if((addr = EFS_AddrMap(addr, 1)) == FLASH_INVALID_ADDR) {
        return(ARM_DRIVER_ERROR_PARAMETER);
    }

    CRITICAL_SECTION_ENTER();
    if (_Flash_Status.busy) {
        CRITICAL_SECTION_EXIT();
        return( ARM_DRIVER_ERROR_BUSY );
    }
    _Flash_Status.busy  = 1;
    _Flash_Status.error = 0;
    CRITICAL_SECTION_EXIT();

    status = Flash_Erase(addr);

    CRITICAL_SECTION_ENTER();
    if (status != ARM_DRIVER_OK) {
        _Flash_Status.error = 1;
    }
    _Flash_Status.busy = 0;
    CRITICAL_SECTION_EXIT();

    return( status );
}


/**
 * Get Flash information.
 *
 * @return  Pointer to Flash information \ref ARM_FLASH_INFO
 */
static ARM_FLASH_INFO* EFS_GetInfo(void)
{
    return( &_EFS_FlashInfo );
}


/* EFS Flash Driver Control Block */
ARM_DRIVER_FLASH  ARM_Driver_Flash_(EFS_FLASH_NUM) = {
    GetVersion,
    GetCapabilities,
    Initialize,
    Uninitialize,
    PowerControl,
    EFS_ReadData,
    EFS_ProgramData,
    EFS_EraseSector,
    EraseChip,
    GetStatus,
    EFS_GetInfo
};


#endif
/******************************************************************************/
//lint -save -w1
#if 0
static const uint32_t _xBuff[8] = {  0x5A5A5A5A
                                  , 0xA5A5A5A5
                                  , 0x96969696
                                  , 0x69696969
                                  , 0x3C3C3C3C
                                  , 0xC3C3C3C3
                                  , 0x1E1E1E1E
                                  , 0xE1E1E1E1
                                 };
static uint32_t       _rBuff[2048 / sizeof(uint32_t)];
static uint32_t       _wBuff[2048 / sizeof(uint32_t)];

