PathZW/Pss/Bsp/STM32xx_Board/Flash_STM32xx.c
static void Flash_WriteTest(ARM_DRIVER_FLASH *flashDev, uint32_t addr1, uint32_t addr2)
{
    uint32_t              i, j, addr, cnt;

    for(i = 0, cnt = sizeof(_wBuff) - i * 3, addr = addr1 + i;  (addr + cnt) <= addr2;)
    {
        for(j = 0;  j < ARRAY_SIZE(_wBuff);  j++)
        {
            _wBuff[j] =   ((addr ^ _xBuff[j % ARRAY_SIZE(_xBuff)]) & ~(ARRAY_SIZE(_wBuff) - 1))
                       | ((~j) % ARRAY_SIZE(_wBuff));
        }
        if (flashDev->ProgramData(addr, _wBuff, cnt) != cnt) {
            LOG_ASSERT("Error Program, Addr: 0x%08lX, Len: 0x%08lX", addr, cnt);
        }
        i     = (i + 1) % 4;
        cnt   = sizeof(_wBuff) - i * 3;
        addr += sizeof(_wBuff) + i;
    }
}

static void Flash_ReadTest(ARM_DRIVER_FLASH *flashDev, uint32_t addr1, uint32_t addr2)
{
    uint32_t              i, j, addr, cnt;

    for(i = 0, cnt = sizeof(_wBuff) - i * 3, addr = addr1 + i;  (addr + cnt) <= addr2;)
    {
        for(j = 0;  j < ARRAY_SIZE(_wBuff);  j++)
        {
            _wBuff[j] =   ((addr ^ _xBuff[j % ARRAY_SIZE(_xBuff)]) & ~(ARRAY_SIZE(_wBuff) - 1))
                       | ((~j) % ARRAY_SIZE(_wBuff));
            _rBuff[j] = 0;
        }
        if (flashDev->ReadData(addr, _rBuff, cnt) != cnt) {
            LOG_ASSERT("Error Read, Addr: 0x%08lX, Len: 0x%08lX", addr, cnt);
        }
        for(j = 0;  j < cnt;  j++)
        {
            if (((uint8_t *)_rBuff)[j] != ((uint8_t *)_wBuff)[j]) {
                LOG_ASSERT(  "Error Program Check, Addr: 0x%08lX, P/R: 0x%02lX / 0x%02lX"
                           , (uint32_t)addr + j
                           , (uint32_t)((uint8_t *)_wBuff)[j]
                           , (uint32_t)((uint8_t *)_rBuff)[j]
                          );
            }
        }
        i     = (i + 1) % 4;
        cnt   = sizeof(_wBuff) - i * 3;
        addr += sizeof(_wBuff) + i;
    }
}

static void Flash_EraseTest(ARM_DRIVER_FLASH *flashDev, uint32_t sec1, uint32_t sec2)
{
    ARM_FLASH_INFO  *flashInf = flashDev->GetInfo();
    uint32_t         adr1 = flashInf->sector_info[sec1 - 0].start;
    uint32_t         adr2 = flashInf->sector_info[sec2 - 1].end + 1;
    uint8_t          temp;
    uint32_t         i;

    for(i = sec1;  i < sec2;  i++)
    {
        if (flashDev->EraseSector(flashInf->sector_info[i].start) != ARM_DRIVER_OK) {
            LOG_ASSERT("Error Erase, Addr: 0x%08lX", flashInf->sector_info[i].start);
        }
    }
    for(i = adr1;  i < adr2;  i++)
    {
        flashDev->ReadData(i, &temp, sizeof(uint8_t));
        if (temp != flashInf->erased_value) {
            LOG_ASSERT(  "Error Erase Check, Addr: 0x%08lX, E/R: 0x%02lX/0x%02lX"
                       , (uint32_t) i
                       , (uint32_t) flashInf->erased_value
                       , (uint32_t) temp
                      );
        }
    }
}

void Flash_Test(void)
{
    ARM_FLASH_INFO     *flashInf0;
    ARM_FLASH_INFO     *flashInf1;
    ARM_DRIVER_FLASH   *flashDev0 = &(ARM_Driver_Flash_(IAP_FLASH_NUM));
    ARM_DRIVER_FLASH   *flashDev1 = &(ARM_Driver_Flash_(EFS_FLASH_NUM));
    const ARM_FLASH_CAPABILITIES capb0 = flashDev0->GetCapabilities();
    const ARM_FLASH_CAPABILITIES capb1 = flashDev1->GetCapabilities();

    // Initialize
    if (flashDev0->Initialize(NULL) != ARM_DRIVER_OK) {
        LOG_ASSERT("Error Initialize IAP Flash");
    }
    if (flashDev1->Initialize(NULL) != ARM_DRIVER_OK) {
        LOG_ASSERT("Error Initialize EFS Flash");
    }
    flashInf0 = flashDev0->GetInfo();
    flashInf1 = flashDev1->GetInfo();

    // PowerControl
    if (flashDev0->PowerControl(ARM_POWER_FULL) != ARM_DRIVER_OK) {
        LOG_ASSERT("Error PowerControl IAP Flash");
    }
    if (flashDev1->PowerControl(ARM_POWER_FULL) != ARM_DRIVER_OK) {
        LOG_ASSERT("Error PowerControl EFS Flash");
    }

    uint32_t  EFS_Sec1 = 0;
    uint32_t  EFS_Sec2 = flashInf1->sector_count;
    uint32_t  EFS_Adr1 = flashInf1->sector_info[EFS_Sec1 - 0].start;
    uint32_t  EFS_Adr2 = flashInf1->sector_info[EFS_Sec2 - 1].end + 1;
    uint32_t  IAP_Sec1 = 0;
    uint32_t  IAP_Sec2 = 0;
    uint32_t  IAP_Adr1 = 0;
    uint32_t  IAP_Adr2 = EFS_Adr1;
    for(IAP_Sec1 = 0;  IAP_Sec1 < flashInf0->sector_count;  IAP_Sec1++)
    {
        if (flashInf0->sector_info[IAP_Sec1].start > ROM_LINK_LIMIT) {
            break;
        }
    }
    if (IAP_Sec1 >= flashInf0->sector_count) {
        LOG_ASSERT("Can't test IAP Flash");  // 开始扇区无效
    }
    if ((IAP_Adr1 = flashInf0->sector_info[IAP_Sec1].start) > EFS_Adr1) {
        LOG_ASSERT("Can't test IAP Flash");  // 开始地址无效
    }
    for(IAP_Sec2 = IAP_Sec1;  IAP_Sec2 < flashInf0->sector_count;  IAP_Sec2++)
    {
        if (flashInf0->sector_info[IAP_Sec2].start >= EFS_Adr1) {
            break;
        }
    }
    if (flashInf0->sector_info[IAP_Sec2].start > EFS_Adr1) {
        LOG_ASSERT("Can't test IAP Flash");  // 结束扇区无效
    }

    // EraseSector
    Flash_EraseTest(flashDev0, IAP_Sec1, IAP_Sec2);
    Flash_EraseTest(flashDev1, EFS_Sec1, EFS_Sec2);

    // ProgramData
    Flash_WriteTest(flashDev0, IAP_Adr1, IAP_Adr2);
    LOG_INFO("IAP Flash Program Test ok");
    Flash_WriteTest(flashDev1, EFS_Adr1, EFS_Adr2);
    LOG_INFO("EFS Flash Program Test ok");

    // ReadData
    Flash_ReadTest(flashDev0, IAP_Adr1, IAP_Adr2);
    LOG_INFO("IAP Flash Read and Check Test ok");
    Flash_ReadTest(flashDev1, EFS_Adr1, EFS_Adr2);
    LOG_INFO("EFS Flash Read and Check Test ok");

    // EraseSector
    Flash_EraseTest(flashDev0, IAP_Sec1, IAP_Sec2);
    LOG_INFO("IAP Flash Erase and Check Test ok");
    Flash_EraseTest(flashDev1, EFS_Sec1, EFS_Sec2);
    LOG_INFO("EFS Flash Erase and Check Test ok");

    LOG_INFO("End of test");
    while (1)
    {
        DelayMS(100);
    }
}
#endif
//lint -restore


/*****************************  END OF FILE  ***********************************
 * @}
 * @}
 *****************************  END OF FILE  **********************************/

